# DSelectObj

## Description
Deselects all objects which match the search criteria.

```pascal
PROCEDURE DSelectObj(c : CRITERIA);
```

```python
def vs.DSelectObj(c):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|c|CRITERIA|Search criteria.|

## Examples
==== VectorScript ====
```pascal
DSelectObj(S='Pine Tree');
{deselects all 'Pine Tree' symbols}
```
==== Python ====
```python

```

## Version
Availability: from All Versions

## Category
* Criteria